Clomann/stm32h7-CAN-sniffer/middleware/Sd/Sd.c
/*
 * Sd.c
 *
 *  Created on: Dec 26, 2024
 *      Author: cbromann
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "stm32h7xx_hal.h"

#include "Sd.h"
#include "SpiAbs.h"

#undef COUNTOF
#define COUNTOF(__BUFFER__) (sizeof(__BUFFER__) / sizeof(*(__BUFFER__)))

// Bit positions for OCR fields
#define OCR_BUSY_BIT_POS        31 // Card Power-Up Status (Busy)
#define OCR_CCS_BIT_POS         30 // Card Capacity Status (CCS)
#define OCR_UHSII_BIT_POS       29 // UHS-II Card (always 0 in SPI mode)
#define OCR_SWITCH_1_8V_BIT_POS 24 // Switching to 1.8V accepted

// Bit positions for Voltage Range Support
#define OCR_VOLTAGE_3_5_3_6_POS 23 // Voltage range 3.5V - 3.6V
#define OCR_VOLTAGE_3_4_3_5_POS 22 // Voltage range 3.4V - 3.5V
#define OCR_VOLTAGE_3_3_3_4_POS 21 // Voltage range 3.3V - 3.4V
#define OCR_VOLTAGE_3_2_3_3_POS 20 // Voltage range 3.2V - 3.3V
#define OCR_VOLTAGE_3_1_3_2_POS 19 // Voltage range 3.1V - 3.2V
#define OCR_VOLTAGE_3_0_3_1_POS 18 // Voltage range 3.0V - 3.1V
#define OCR_VOLTAGE_2_9_3_0_POS 17 // Voltage range 2.9V - 3.0V
#define OCR_VOLTAGE_2_8_2_9_POS 16 // Voltage range 2.8V - 2.9V
#define OCR_VOLTAGE_2_7_2_8_POS 15 // Voltage range 2.7V - 2.8V

// Bit mask for reserved fields
#define OCR_RESERVED_25_28_MASK (0x0F << 25) // Bits 25–28
#define OCR_RESERVED_0_14_MASK  (0x7FFF) // Bits 0–14

// Check Power-Up Status (Bit 31)
#define IS_CARD_READY(ocr) (((ocr) >> OCR_BUSY_BIT_POS) & 0x1)

// Check Card Capacity Status (Bit 30)
#define IS_CARD_SDHX(ocr) (((ocr) >> OCR_CCS_BIT_POS) & 0x1)

// Check UHS-II Card Status (Bit 29)
#define IS_UHSII_CARD(ocr) (((ocr) >> OCR_UHSII_BIT_POS) & 0x1)

// Check Switching to 1.8V (Bit 24)
#define IS_SWITCH_1_8V(ocr) (((ocr) >> OCR_SWITCH_1_8V_BIT_POS) & 0x1)

// Check Voltage Range Bits
#define IS_VOLTAGE_3_5_3_6(ocr) (((ocr) >> OCR_VOLTAGE_3_5_3_6_POS) & 0x1)
#define IS_VOLTAGE_3_4_3_5(ocr) (((ocr) >> OCR_VOLTAGE_3_4_3_5_POS) & 0x1)
#define IS_VOLTAGE_3_3_3_4(ocr) (((ocr) >> OCR_VOLTAGE_3_3_3_4_POS) & 0x1)
#define IS_VOLTAGE_3_2_3_3(ocr) (((ocr) >> OCR_VOLTAGE_3_2_3_3_POS) & 0x1)
#define IS_VOLTAGE_3_1_3_2(ocr) (((ocr) >> OCR_VOLTAGE_3_1_3_2_POS) & 0x1)
#define IS_VOLTAGE_3_0_3_1(ocr) (((ocr) >> OCR_VOLTAGE_3_0_3_1_POS) & 0x1)
#define IS_VOLTAGE_2_9_3_0(ocr) (((ocr) >> OCR_VOLTAGE_2_9_3_0_POS) & 0x1)
#define IS_VOLTAGE_2_8_2_9(ocr) (((ocr) >> OCR_VOLTAGE_2_8_2_9_POS) & 0x1)
#define IS_VOLTAGE_2_7_2_8(ocr) (((ocr) >> OCR_VOLTAGE_2_7_2_8_POS) & 0x1)

#define SD_SPI_PRE_CMD_CLOCKS 8U
#define SD_ERASE_CHUNK_BLOCKS 4096U

static ErrorContextType ErrorContext = {.file = __FILE_NAME__};

/**
 * @brief Debug-only counter of SD hot-reset calls.
 *
 * Used during GDB debugging and may later be surfaced in logging.
 */
static volatile uint32_t HotResetCallCount = 0U;

/* Buffer used for transmission */
static uint8_t SPI_CMD_READ_BUFFER[SD_SDHC_SECTOR_SIZE] = {0};

uint8_t aTxSpiCmd[7];

ALIGN_32BYTES(const uint8_t __attribute__((used, section(".dma_buffer.ro"))
) aTxSpiInit[18]) = {
    0xFF,
    0xFF,
    0xFF,
    0xFF,
    0xFF,
    0xFF,
    0xFF,
    0xFF,
    0xFF,
    0xFF,
    0xFF,
    0xFF,
    0xFF,
    0xFF,
    0xFF,
    0xFF,
    0xFF,
    0xFF
};

static uint8_t SD_Crc7(const uint8_t *data, uint8_t len)
{
    uint8_t crc = 0;

    while (len--)
    {
        uint8_t d = *data++;

        for (uint8_t i = 0; i < 8; i++)
        {
            crc <<= 1;

            if ((d ^ crc) & 0x80)
            {
                crc ^= 0x09;
            }

            d <<= 1;
        }
    }

    return (crc << 1) | 1; // append end bit
}

static uint8_t
SD_Spi_CreateCommand(uint8_t cmd, uint32_t payload, uint8_t *buffer)
{
    uint8_t RetVal = SD_E_OK;

    // first dummy byte to give SD card some idle time
    buffer[0] = 0xFF;

    switch (cmd)
    {
    case SD_SPI_CMD0:
        buffer[1] = 0x40;
        buffer[2] = 0x00;
        buffer[3] = 0x00;
        buffer[4] = 0x00;
        buffer[5] = 0x00;
        buffer[6] = 0x95;
        break;
    case SD_SPI_CMD8:
        buffer[1] = 0x48;
        buffer[2] = 0x00;
        buffer[3] = 0x00;
        buffer[4] = 0x01;
        buffer[5] = 0xAA;
        buffer[6] = 0x87;
        break;
    case SD_SPI_CMD9:
        buffer[1] = 0x49;
        buffer[2] = (payload >> 24) & 0xFF;
        buffer[3] = (payload >> 16) & 0xFF;
        buffer[4] = (payload >> 8) & 0xFF;
        buffer[5] = payload & 0xFF;
        buffer[6] = SD_Crc7(&buffer[1], 5);
        break;
    case SD_SPI_CMD12:
        buffer[1] = 0x4C;
        buffer[2] = 0x00;
        buffer[3] = 0x00;
        buffer[4] = 0x00;
        buffer[5] = 0x00;
        buffer[6] = SD_Crc7(&buffer[1], 5);
        break;
    case SD_SPI_CMD13:
        buffer[1] = 0x4D;
        buffer[2] = 0x00;
        buffer[3] = 0x00;
        buffer[4] = 0x00;
        buffer[5] = 0x00;
        buffer[6] = SD_Crc7(&buffer[1], 5);
        break;
    case SD_SPI_CMD16:
        buffer[1] = 0x50;
        buffer[2] = (payload >> 24) & 0xFF;
        buffer[3] = (payload >> 16) & 0xFF;
        buffer[4] = (payload >> 8) & 0xFF;
        buffer[5] = payload & 0xFF;
        buffer[6] = SD_Crc7(&buffer[1], 5);
        break;
    case SD_SPI_CMD17:
        buffer[1] = 0x51;
        buffer[2] = (payload >> 24) & 0xFF;
        buffer[3] = (payload >> 16) & 0xFF;
        buffer[4] = (payload >> 8) & 0xFF;
        buffer[5] = payload & 0xFF;
        buffer[6] = SD_Crc7(&buffer[1], 5);
        break;
    case SD_SPI_CMD18:
        buffer[1] = 0x52;
        buffer[2] = (payload >> 24) & 0xFF;
        buffer[3] = (payload >> 16) & 0xFF;
        buffer[4] = (payload >> 8) & 0xFF;
        buffer[5] = payload & 0xFF;
        buffer[6] = SD_Crc7(&buffer[1], 5);
        break;
    case SD_SPI_CMD24:
        buffer[1] = 0x58;
        buffer[2] = (payload >> 24) & 0xFF;
        buffer[3] = (payload >> 16) & 0xFF;
        buffer[4] = (payload >> 8) & 0xFF;
        buffer[5] = payload & 0xFF;
        buffer[6] = SD_Crc7(&buffer[1], 5);
        break;
    case SD_SPI_CMD25:
        buffer[1] = 0x59;
        buffer[2] = (payload >> 24) & 0xFF;
        buffer[3] = (payload >> 16) & 0xFF;
        buffer[4] = (payload >> 8) & 0xFF;
        buffer[5] = payload & 0xFF;
        buffer[6] = SD_Crc7(&buffer[1], 5);
        break;
    case SD_SPI_CMD32:
        buffer[1] = 0x40 + 32U;
        buffer[2] = (payload >> 24) & 0xFF;
        buffer[3] = (payload >> 16) & 0xFF;
        buffer[4] = (payload >> 8) & 0xFF;
        buffer[5] = payload & 0xFF;
        buffer[6] = SD_Crc7(&buffer[1], 5);
        break;
    case SD_SPI_CMD33:
        buffer[1] = 0x40 + 33U;
        buffer[2] = (payload >> 24) & 0xFF;
        buffer[3] = (payload >> 16) & 0xFF;
        buffer[4] = (payload >> 8) & 0xFF;
        buffer[5] = payload & 0xFF;
        buffer[6] = SD_Crc7(&buffer[1], 5);
        break;
    case SD_SPI_CMD38:
        buffer[1] = 0x40 + 38U;
        buffer[2] = (payload >> 24) & 0xFF;
        buffer[3] = (payload >> 16) & 0xFF;
        buffer[4] = (payload >> 8) & 0xFF;
        buffer[5] = payload & 0xFF;
        buffer[6] = SD_Crc7(&buffer[1], 5);
        break;
    case SD_SPI_CMD55:
        buffer[1] = 0x77;
        buffer[2] = 0x00;
        buffer[3] = 0x00;
        buffer[4] = 0x00;
        buffer[5] = 0x00;
        buffer[6] = SD_Crc7(&buffer[1], 5);
        break;
    case SD_SPI_CMD58:
        buffer[1] = 0x7A;
        buffer[2] = 0x00;
        buffer[3] = 0x00;
        buffer[4] = 0x00;
        buffer[5] = 0x00;
        buffer[6] = SD_Crc7(&buffer[1], 5);
        break;
    case SD_SPI_ACMD41:
        buffer[1] = 0x69;
        buffer[2] = (payload >> 24) & 0xFF;
        buffer[3] = (payload >> 16) & 0xFF;
        buffer[4] = (payload >> 8) & 0xFF;
        buffer[5] = payload & 0xFF;
        buffer[6] = SD_Crc7(&buffer[1], 5);
        break;
    default:
        buffer[1] = 0xFF;
        buffer[2] = 0xFF;
        buffer[3] = 0xFF;
        buffer[4] = 0xFF;
        buffer[5] = 0xFF;
        buffer[6] = 0xFF;
        RetVal    = SD_E_NOT_OK;
    }

    return RetVal;
}

static void SD_Spi_Ocr2Bitfield(uint32_t ocr, OCR_Register *out)
{
    out->ccs             = IS_CARD_SDHX(ocr);
    out->cpusb           = IS_CARD_READY(ocr);
    out->switching_1_8_V = IS_SWITCH_1_8V(ocr);
    out->uhs_ii_card     = IS_UHSII_CARD(ocr);
    out->voltage_2_7_2_8 = IS_VOLTAGE_2_7_2_8(ocr);
    out->voltage_2_8_2_9 = IS_VOLTAGE_2_8_2_9(ocr);
    out->voltage_2_9_3_0 = IS_VOLTAGE_2_9_3_0(ocr);
    out->voltage_3_0_3_1 = IS_VOLTAGE_3_0_3_1(ocr);
    out->voltage_3_2_3_3 = IS_VOLTAGE_3_2_3_3(ocr);
    out->voltage_3_3_3_4 = IS_VOLTAGE_3_3_3_4(ocr);
    out->voltage_3_4_3_5 = IS_VOLTAGE_3_4_3_5(ocr);
    out->voltage_3_5_3_6 = IS_VOLTAGE_3_5_3_6(ocr);
}

/**
 *
 *
 * \brief
 *
 * \note This function only supports the CSD version 2 type.
 */
static void SD_Spi_Csd2Bitfield(uint8_t *csd, SdCsdRegisterType *out)
{
    uint8_t buf[SD_SPI_CSD_LENGTH];
    uint8_t i = 0U;
    uint8_t CSizeByte0, CSizeByte1, CSizeByte2;
    uint8_t CccByte0, CccByte1;

