Clomann/stm32h7-CAN-sniffer/middleware/Sd/Sd.c
    for (i = 0U; i < SD_SPI_CSD_LENGTH; i++)
    {
        buf[(SD_SPI_CSD_LENGTH - 1U) - i] = csd[i];
    }

    out->csdStructure = EXTRACT_CSD_BITS(
        buf,
        SD_CSD_CSD_STRUCTURE_MSK,
        SD_CSD_CSD_STRUCTURE_START
    );
    out->taac = EXTRACT_CSD_BITS(buf, SD_CSD_TAAC_MSK, SD_CSD_TAAC_START);
    out->nsac = EXTRACT_CSD_BITS(buf, SD_CSD_NSAC_MSK, SD_CSD_NSAC_START);
    out->tranSpeed =
        EXTRACT_CSD_BITS(buf, SD_CSD_TRAN_SPEED_MSK, SD_CSD_TRAN_SPEED_START);
    CccByte1 = EXTRACT_CSD_BITS(buf, SD_CSD_CCC1_MSK, SD_CSD_CCC1_START);
    CccByte0 = EXTRACT_CSD_BITS(buf, SD_CSD_CCC0_MSK, SD_CSD_CCC0_START);
    out->ccc = (CccByte0 << 8U) | CccByte1;
    out->readBlLen =
        EXTRACT_CSD_BITS(buf, SD_CSD_READ_BL_LEN_MSK, SD_CSD_READ_BL_LEN_START);
    out->readBlPartial = EXTRACT_CSD_BITS(
        buf,
        SD_CSD_READ_BL_PARTIAL_MSK,
        SD_CSD_READ_BL_PARTIAL_START
    );
    //	out->writeBlkMisalign
    //	out->readBlkMisalign
    //	out->dsrImp
    CSizeByte0 =
        EXTRACT_CSD_BITS(buf, SD_CSD_C_SIZE0_MSK, SD_CSD_C_SIZE0_START);
    CSizeByte1 =
        EXTRACT_CSD_BITS(buf, SD_CSD_C_SIZE1_MSK, SD_CSD_C_SIZE1_START);
    CSizeByte2 =
        EXTRACT_CSD_BITS(buf, SD_CSD_C_SIZE2_MSK, SD_CSD_C_SIZE2_START);
    out->cSize = (CSizeByte2 << 16U) | (CSizeByte1 << 8U) | (CSizeByte0);
    //	out->vddRCurrMin
    //	out->vddRCurrMax
    //	out->vddWCurrMin
    //	out->vddWCurrMax
    out->eraseBlkEn = EXTRACT_CSD_BITS(
        buf,
        SD_CSD_ERASE_BLK_EN_MSK,
        SD_CSD_ERASE_BLK_EN_START
    );
    out->sectorSize =
        EXTRACT_CSD_BITS(buf, SD_CSD_SECTOR_SIZE_MSK, SD_CSD_SECTOR_SIZE_START);
    //	out->wpGrpSize = EXTRACT_CSD_BITS(buf, SD_CSD_, SD_CSD_FILE_);
    //	out->wpGrpEnable = EXTRACT_CSD_BITS(buf, SD_CSD_, SD_CSD_FILE_);
    //	out->reserved3 = EXTRACT_CSD_BITS(buf, SD_CSD_, SD_CSD_FILE_);
    //	out->r2wFactor = EXTRACT_CSD_BITS(buf, SD_CSD_, SD_CSD_FILE_);
    //	out->writeBlLen = EXTRACT_CSD_BITS(buf, SD_CSD_, SD_CSD_FILE_);
    //	out->writeBlPartial = EXTRACT_CSD_BITS(buf, SD_CSD_, SD_CSD_FILE_);
    //	out->fileFormatGrp = EXTRACT_CSD_BITS(buf, SD_CSD_, SD_CSD_FILE_);
    //	out->copy = EXTRACT_CSD_BITS(buf, SD_CSD_, SD_CSD_FILE_);
    //	out->permWriteProtect = EXTRACT_CSD_BITS(buf, SD_CSD_, SD_CSD_FILE_);
    //	out->tempWriteProtect = EXTRACT_CSD_BITS(buf, SD_CSD_, SD_CSD_FILE_);
    out->fileFormat =
        EXTRACT_CSD_BITS(buf, SD_CSD_FILE_FORMAT_MSK, SD_CSD_FILE_FORMAT_START);
    out->crc = EXTRACT_CSD_BITS(buf, SD_CSD_CRC_MSK, SD_CSD_CRC_START);
    out->always1 =
        EXTRACT_CSD_BITS(buf, SD_CSD_ALWAYS1_MSK, SD_CSD_ALWAYS1_START);
}

static uint8_t SD_Spi_WaitBusy(uint32_t maxAttempts)
{
    uint32_t attempts = 0;
    uint8_t resp;

    do
    {
        SpiAbs_readByte(SPIABS_DEVICE_1, &resp);
        if (resp == 0xFF)
        {
            break;
        }
        if (attempts >= 500U)
        {
            Sd_Spi_OsTaskDelayHook(2);
        }
    } while (++attempts < maxAttempts);

    return (resp == 0xFF) ? 0U : 1U;
}

uint8_t SD_Spi_SendCommand(uint8_t cmd, uint32_t payload)
{
    uint8_t res = SD_E_OK;

    res = SD_Spi_CreateCommand(cmd, payload, aTxSpiCmd);

    if (SD_E_OK == res)
    {
        res = SpiAbs_Send_Spi1_Task0((uint8_t *)aTxSpiCmd, COUNTOF(aTxSpiCmd));

        if (SPIABS_E_OK != res)
        {
            res = SD_E_SEND;
        }
    }

    return res;
}

uint8_t
SD_Spi_SendCommandPollResponse(uint8_t cmd, uint32_t payload, uint8_t *resp)
{
    // assert chip select
    SpiAbs_CsEnable(SPIABS_DEVICE_1);

    SD_Spi_SendCommand(cmd, payload);
    SpiAbs_PollForResponse(SPIABS_DEVICE_1, resp);

    // deassert chip select
    SpiAbs_CsDisable(SPIABS_DEVICE_1);

    return 0U;
}

uint8_t SD_Spi_PowerUp(void)
{
    SpiAbs_CsDisable(SPIABS_DEVICE_1);

    SpiAbs_Send_Spi1_Task0((uint8_t *)aTxSpiInit, COUNTOF(aTxSpiInit));

    return 0;
}

uint8_t SD_Spi_WaitTillIdle()
{
    uint8_t RetVal  = 1;
    uint8_t counter = 0;
    uint8_t buffer[1];
    const uint8_t RetryCount = 10;

    SpiAbs_CsEnable(SPIABS_DEVICE_1);

    // wait till card is idle
    do
    {
        SpiAbs_Receive_Spi1_Task0(buffer, sizeof(buffer));
    } while (0xFF != buffer[0] && (RetryCount > counter++));

    SpiAbs_CsDisable(SPIABS_DEVICE_1);

    if (0xFF == buffer[0])
    {
        RetVal = 1;
    }
    else
    {
        RetVal = 0;
    }
    return RetVal;
}

uint8_t SD_Spi_GoIdleState(Spi_R1Response *pResponse)
{
    uint8_t i;
    uint8_t res = SD_E_OK;

    if (pResponse == NULL)
    {
        return SD_E_INV_PARAM;
    }

    pResponse->byte = 0xFF;

    SpiAbs_CsDisable(SPIABS_DEVICE_1);

    for (i = 0U; i < SD_SPI_PRE_CMD_CLOCKS; i++)
    {
        res = SpiAbs_readByte(
            SPIABS_DEVICE_1,
            &pResponse->byte
        ); // Ensure idle state

        if (SPIABS_E_OK != res)
        {
            return SD_E_NOT_OK;
        }
    }

    // assert chip select
    SpiAbs_CsEnable(SPIABS_DEVICE_1);

    res = SD_Spi_SendCommand(SD_SPI_CMD0, 0x00000000);

    if (SD_E_OK == res)
    {
        res = SpiAbs_PollForResponse(SPIABS_DEVICE_1, &pResponse->byte);

        if (SPIABS_E_OK != res)
        {
            res = SD_E_RESPONSE;
        }
    }

    // deassert chip select
    SpiAbs_CsDisable(SPIABS_DEVICE_1);

    return res;
}

// uint8_t SD_Spi_SendWakeUp(Spi_R1Response * pResponse)
// {
// 	SpiAbs_CsEnable(SPIABS_DEVICE_1);

// 	SD_Spi_SendCommand(SD_SPI_CMD1, 0);
// 	SpiAbs_PollForResponse(SPIABS_DEVICE_1, &pResponse->byte);

// 	SpiAbs_CsDisable(SPIABS_DEVICE_1);

// 	return 0U;
// }

uint8_t SD_Spi_SendIfCond(Spi_R1Response *pResponse)
{
    // assert chip select
    SpiAbs_CsEnable(SPIABS_DEVICE_1);

    // send CMD8
    SD_Spi_SendCommand(SD_SPI_CMD8, 0x00000000);
    SpiAbs_PollForResponse(SPIABS_DEVICE_1, &pResponse->byte);

    // deassert chip select
    SpiAbs_CsDisable(SPIABS_DEVICE_1);

