Clomann/stm32h7-CAN-sniffer/middleware/Sd/Sd.c
/*******************************************************************************
 Read single 512 byte block
 token = 0xFE - Successful read
 token = 0x0X - Data error
 token = 0xFF - Timeout
*******************************************************************************/
uint8_t SD_Spi_readSingleBlock(uint32_t address, Spi_R1Response *pResponse)
{
    uint8_t RetVal;
    uint32_t readAttempts, tokenPollCount;
    uint8_t *readBuffer;
    uint8_t CardStatus, Dummy[SD_SPI_PRE_CMD_CLOCKS];
    uint16_t Crc = 0;
    Spi_R1Response resp;
    uint8_t GotResponse;
    uint8_t Run = 0U;

    (void)Run;

    RetVal     = 0U;
    readBuffer = SPI_CMD_READ_BUFFER;

    memset(readBuffer, 0U, SD_SDHC_SECTOR_SIZE);

    SpiAbs_CsDisable(SPIABS_DEVICE_1);

    SpiAbs_Receive_Spi1_Task0(Dummy, sizeof(Dummy));

    SpiAbs_CsEnable(SPIABS_DEVICE_1);

    SD_Spi_SendCommand(SD_SPI_CMD13, 0); // CMD13 to check card status
    SpiAbs_PollForResponse(SPIABS_DEVICE_1, &pResponse->byte);

    switch (pResponse->byte)
    {
    case 0x00: // card is ready
        SpiAbs_Receive_Spi1_Task0(&CardStatus, sizeof(CardStatus));
        break;
    case 0x01: // idle state
        SpiAbs_Receive_Spi1_Task0(&CardStatus, sizeof(CardStatus));
        RetVal = SD_Spi_Initialize(0U);
        break;
    case 0xFF: // not responding
    default:
        SpiAbs_CsDisable(SPIABS_DEVICE_1);
        // TODO: power on and off (somehow the SD card gets unresponsive after a while)
        RetVal = SD_Spi_Initialize(0U);
        break;
    }

    if (0U != RetVal)
    {
        return RetVal;
    }

    SpiAbs_CsDisable(SPIABS_DEVICE_1);

    SpiAbs_Receive_Spi1_Task0(Dummy, sizeof(Dummy));

    SpiAbs_CsEnable(SPIABS_DEVICE_1);

    readAttempts = 0;
    do
    {
        SD_Spi_SendCommand(SD_SPI_CMD17, address);
        SpiAbs_PollForResponse(SPIABS_DEVICE_1, &pResponse->byte);

        if (pResponse->byte != 0xFF)
        {
            // wait for a response token (timeout = 100ms)
            tokenPollCount = 0;
            GotResponse    = 0U;
            while (++tokenPollCount < SD_MAX_READ_RESPONSE_ATTEMPTS)
            {
                SpiAbs_PollForResponse(SPIABS_DEVICE_1, &pResponse->byte);
                if (pResponse->byte != 0xFF)
                {
                    GotResponse = 1U;
                    break;
                }
            }
        }
        else
        {
            RetVal = 2U;
            break;
        }
    } while ((0U == GotResponse) && (3 > readAttempts++));

    if (pResponse->byte == SD_SPI_CMD_START_TOKEN) // if response token is 0xFE
    {
    }
    else if (pResponse->byte
             != SD_SPI_CMD_START_TOKEN) // if response token is 0xFE
    {
        SpiAbs_PollForResponse(SPIABS_DEVICE_1, &resp.byte);

        if (SD_SPI_CMD_START_TOKEN != resp.byte)
        {
            RetVal = 3U;
        }
    }
    else
    {
        RetVal = 1U;
    }

    if (0U == RetVal)
    {
        for (uint32_t i = 0; i < SD_SECTOR_LENGTH;
             i += SD_SPI_SECTOR_CHUNK_SIZE)
        {
            if (SD_SECTOR_LENGTH - i > SD_SPI_SECTOR_CHUNK_SIZE)
            {
                SpiAbs_Receive_Spi1_Task0(
                    &readBuffer[i],
                    SD_SPI_SECTOR_CHUNK_SIZE
                );
            }
            else
            {
                SpiAbs_Receive_Spi1_Task0(&readBuffer[i], SD_SECTOR_LENGTH - i);
            }
        }

        // read 16-bit CRC
        SpiAbs_Receive_Spi1_Task0((uint8_t *)&Crc, sizeof(Crc));

        if (0 != Crc)
        {
            RetVal = 0U;
        }
    }

    return RetVal;
}

uint8_t
SD_Spi_readMultiBlock(uint32_t address, uint8_t *const buff, uint32_t cnt)
{
    uint8_t res;
    uint32_t tokenPollCount;
    uint16_t Crc = 0U;
    Spi_R1Response resp;
    uint8_t Dummy[SD_SPI_PRE_CMD_CLOCKS];
    static uint8_t Tmp[SD_SECTOR_LENGTH + sizeof(Crc)];
    bool stopTransmission;

    res              = 0U;
    stopTransmission = false;

    SpiAbs_CsDisable(SPIABS_DEVICE_1);

    SpiAbs_Receive_Spi1_Task0(Dummy, sizeof(Dummy));

    SpiAbs_CsEnable(SPIABS_DEVICE_1);

    SD_Spi_SendCommand(SD_SPI_CMD18, address);

    SpiAbs_PollForResponse(SPIABS_DEVICE_1, &resp.byte);

    if (resp.byte == 0xFF)
    {
        res = 2U;
    }
    else
    {
        stopTransmission = true;
    }

    if (0 == res)
    {
        for (uint32_t j = 0; j < cnt; j++)
        {
            // wait for a response token (timeout = 100ms)
            tokenPollCount = 0;
            while (++tokenPollCount < SD_MAX_READ_RESPONSE_ATTEMPTS)
            {
                SpiAbs_PollForResponse(SPIABS_DEVICE_1, &resp.byte);
                if (resp.byte == SD_DEF_START_DATA_MARKER)
                {
                    break;
                }
            }

            if (resp.byte != SD_DEF_START_DATA_MARKER)
            {
                res = SD_E_CMD_NO_START_TOKEN;
            }
            else
            {
                res = SpiAbs_Receive_Spi1_Task0(Tmp, sizeof(Tmp));

                memcpy(&buff[j * SD_SECTOR_LENGTH], Tmp, SD_SECTOR_LENGTH);
                memcpy(&Crc, &Tmp[SD_SECTOR_LENGTH], sizeof(Crc));
            }

            if (0 != res)
            {
                break;
            }
        }

        if (stopTransmission)
        {
            SD_Spi_SendCommand(SD_SPI_CMD12, address);
        }
    }

    if (stopTransmission)
    {
        if ((SpiAbs_PollForIdle(
                 SPIABS_DEVICE_1,
                 &resp.byte,
                 SD_MAX_READ_RESPONSE_ATTEMPTS
             )
             != 0)
            && (0 == res))
        {
            res = SD_E_CMD_NO_GOING_IDLE;
        }
    }

    if (0 != res)
    {
        ErrorContext.line = __LINE__;
        ErrorContext.code = res;
        snprintf(
            ErrorContext.function,
            ERRORCONTEXT_FUNCTION_NAME_LENGTH,
            "%s",
            "SD_Spi_readMultiBlock"
        );

        Sd_Spi_ErrorHandlerHook(&ErrorContext);
    }

    SpiAbs_CsDisable(SPIABS_DEVICE_1);

    return res;
}

