Clomann/stm32h7-CAN-sniffer/middleware/Sd/Sd.c
        for (uint32_t i = 0; i < SD_SECTOR_LENGTH;
             i += SD_SPI_SECTOR_CHUNK_SIZE)
        {
            if (SD_SECTOR_LENGTH - i > SD_SPI_SECTOR_CHUNK_SIZE)
            {
                SpiAbs_Send_Spi1_Task0(&buff[i], SD_SPI_SECTOR_CHUNK_SIZE);
            }
            else
            {
                SpiAbs_Send_Spi1_Task0(&buff[i], SD_SECTOR_LENGTH - i);
            }
        }

        SpiAbs_Send_Spi1_Task0((uint8_t *)&Crc, sizeof(Crc));

        SpiAbs_PollForResponse(SPIABS_DEVICE_1, &resp.byte);
        if (SD_DEF_DATA_RESP_TOKEN != (0x0F & resp.byte))
        {
            RetVal = SD_E_CMD_NO_DATA_RESP_TOKEN;
        }
    }

    if (0 == RetVal)
    {
        uint8_t WaitRes = 0;

        WaitRes = SD_Spi_WaitBusy(SD_MAX_READ_RESPONSE_ATTEMPTS);

        if (0 != WaitRes)
        {
            RetVal = SD_E_CMD_NO_GOING_IDLE;
        }
    }

    SpiAbs_CsDisable(SPIABS_DEVICE_1);

    return RetVal;
}

/**
 * @brief Compute total 512-byte logical block count for CSD v2 cards.
 * @param csd Parsed CSD register.
 * @param totalBlocksOut Out: total logical block count.
 * @return SD_E_OK on success, otherwise SD_E_* error code.
 */
static uint8_t
SD_Spi_TotalBlocks512(const SdCsdRegisterType *csd, uint32_t *totalBlocksOut)
{
    uint64_t totalBlocks64;

    if ((NULL == csd) || (NULL == totalBlocksOut))
    {
        return SD_E_NOT_OK;
    }

    if (1U != csd->csdStructure)
    {
        /* Dummy/error path for non-SDHC cards until SDSC CSD-v1 support is added. */
        *totalBlocksOut = 0U;
        return SD_E_UNSUPPORTED_CARD_TYPE;
    }

    totalBlocks64 = ((uint64_t)csd->cSize + 1ULL) * 1024ULL;
    if (totalBlocks64 > (uint64_t)UINT32_MAX)
    {
        *totalBlocksOut = 0U;
        return SD_E_CAPACITY_OVERFLOW;
    }

    *totalBlocksOut = (uint32_t)totalBlocks64;
    return SD_E_OK;
}

uint8_t SD_Spi_TrimAll(uint32_t *blocks_trimmed)
{
    return SD_Spi_EraseAll(blocks_trimmed);
}

uint8_t SD_Spi_EraseAll(uint32_t *blocks_erased)
{
    uint8_t res;
    uint32_t totalBlocks;
    uint32_t eraseBlockSize;
    uint32_t currentBlock;
    uint32_t chunkLimitBlocks;
    uint32_t readResponseAttempts;
    uint8_t dummy[SD_SPI_PRE_CMD_CLOCKS];
    SdCsdRegisterType csd;
    Spi_R1Response resp;

    res = SD_E_OK;

    if (NULL != blocks_erased)
    {
        *blocks_erased = 0U;
    }

    memset(dummy, SD_SPI_CMD_DUMMY_DATA, sizeof(dummy));
    memset(&csd, 0, sizeof(csd));

    res = SD_Spi_ReadCSD(&csd);
    if (SD_E_OK != res)
    {
        ErrorContext.code = res;
        ErrorContext.line = __LINE__;
        snprintf(
            ErrorContext.function,
            ERRORCONTEXT_FUNCTION_NAME_LENGTH,
            "%s",
            "SD_Spi_EraseAll"
        );
        Sd_Spi_ErrorHandlerHook(&ErrorContext);
        return res;
    }

    res = SD_Spi_TotalBlocks512(&csd, &totalBlocks);
    if (SD_E_OK != res)
    {
        ErrorContext.code = res;
        ErrorContext.line = __LINE__;
        snprintf(
            ErrorContext.function,
            ERRORCONTEXT_FUNCTION_NAME_LENGTH,
            "%s",
            "SD_Spi_EraseAll"
        );
        Sd_Spi_ErrorHandlerHook(&ErrorContext);
        return res;
    }

    /* SDHC/SDXC path only: use 512-byte block granularity for erase ranges. */
    eraseBlockSize = 1U;
    currentBlock   = 0U;

    chunkLimitBlocks = SD_ERASE_CHUNK_BLOCKS;
    chunkLimitBlocks -= (chunkLimitBlocks % eraseBlockSize);
    if (0U == chunkLimitBlocks)
    {
        chunkLimitBlocks = eraseBlockSize;
    }

    while (currentBlock < totalBlocks)
    {
        uint32_t remainingBlocks = totalBlocks - currentBlock;
        uint32_t chunkBlocks     = (remainingBlocks > chunkLimitBlocks)
                                       ? chunkLimitBlocks
                                       : remainingBlocks;
        uint32_t startBlock;
        uint32_t endBlock;

        if ((chunkBlocks % eraseBlockSize) != 0U)
        {
            chunkBlocks -= (chunkBlocks % eraseBlockSize);
        }

        if (0U == chunkBlocks)
        {
            res = SD_E_ERASE_END_FAILED;
            break;
        }

        startBlock = currentBlock;
        endBlock   = startBlock + chunkBlocks - 1U;

        SpiAbs_CsDisable(SPIABS_DEVICE_1);
        SpiAbs_Receive_Spi1_Task0(dummy, sizeof(dummy));
        SpiAbs_CsEnable(SPIABS_DEVICE_1);
        SD_Spi_SendCommand(SD_SPI_CMD32, startBlock);
        SpiAbs_PollForResponse(SPIABS_DEVICE_1, &resp.byte);
        SpiAbs_CsDisable(SPIABS_DEVICE_1);

        if (0x00U != resp.byte)
        {
            if ((chunkLimitBlocks > eraseBlockSize) && (0xFFU != resp.byte))
            {
                chunkLimitBlocks = eraseBlockSize;
                continue;
            }

            res = SD_E_ERASE_START_FAILED;
            break;
        }

        SpiAbs_CsDisable(SPIABS_DEVICE_1);
        SpiAbs_Receive_Spi1_Task0(dummy, sizeof(dummy));
        SpiAbs_CsEnable(SPIABS_DEVICE_1);
        SD_Spi_SendCommand(SD_SPI_CMD33, endBlock);
        SpiAbs_PollForResponse(SPIABS_DEVICE_1, &resp.byte);
        SpiAbs_CsDisable(SPIABS_DEVICE_1);

        if (0x00U != resp.byte)
        {
            if ((chunkLimitBlocks > eraseBlockSize) && (0xFFU != resp.byte))
            {
                chunkLimitBlocks = eraseBlockSize;
                continue;
            }

            res = SD_E_ERASE_END_FAILED;
            break;
        }

        SpiAbs_CsDisable(SPIABS_DEVICE_1);
        SpiAbs_Receive_Spi1_Task0(dummy, sizeof(dummy));
        SpiAbs_CsEnable(SPIABS_DEVICE_1);
        SD_Spi_SendCommand(SD_SPI_CMD38, 0x00000000U);
        SpiAbs_PollForResponse(SPIABS_DEVICE_1, &resp.byte);

        if (0x00U != resp.byte)
        {
            SpiAbs_CsDisable(SPIABS_DEVICE_1);

            if ((chunkLimitBlocks > eraseBlockSize) && (0xFFU != resp.byte))
            {
                chunkLimitBlocks = eraseBlockSize;
                continue;
            }

            res = SD_E_ERASE_CMD_FAILED;
            break;
        }

        readResponseAttempts = 0U;
        do
        {
            SpiAbs_PollForResponse(SPIABS_DEVICE_1, &resp.byte);
        } while ((0xFFU != resp.byte)
                 && (++readResponseAttempts < SD_ERASE_BUSY_TIMEOUT_ATTEMPTS));

        if (readResponseAttempts >= SD_ERASE_BUSY_TIMEOUT_ATTEMPTS)
        {
            SpiAbs_CsDisable(SPIABS_DEVICE_1);
            res = SD_E_CMD_NO_GOING_IDLE;
            break;
        }

        SpiAbs_CsDisable(SPIABS_DEVICE_1);

        currentBlock += chunkBlocks;

        if (NULL != blocks_erased)
        {
            *blocks_erased = currentBlock;
            res            = SD_E_OK;
        }
    }

    if (SD_E_OK != res)
    {
        ErrorContext.code = res;
        ErrorContext.line = __LINE__;
        snprintf(
            ErrorContext.function,
            ERRORCONTEXT_FUNCTION_NAME_LENGTH,
            "%s",
            "SD_Spi_EraseAll"
        );
        Sd_Spi_ErrorHandlerHook(&ErrorContext);
    }

    return res;
}

uint8_t SD_Spi_GetReadBytes(uint8_t *buff)
{
    memcpy(buff, SPI_CMD_READ_BUFFER, SD_SDHC_SECTOR_SIZE);
    return 0U;
}

__attribute__((weak)) uint8_t Sd_Spi_OsTaskDelayHook(uint32_t delay)
{
    (void)delay;

    return 0;
}
